Revit 2027 API
ImageTypeOptions.PageNumber Property
 The page in the file to be used for the image
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int PageNumber { get; set; }
Public Property PageNumber As Integer
	Get
	Set
public:
property int PageNumber {
	int get ();
	void set (int value);
}
member PageNumber : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for pageNumber is not positive.
Remarks
 The default value of this property is 1. This default is appropriate for most file types. This should be used for files, such as PDF files, that can have multiple pages. Valid values range from 1 to the number of pages in the file.
See Also
Reference
ImageTypeOptions Class
Autodesk.Revit.DB Namespace